--------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\stata\final2\mylog.log
  log type:  text
 opened on:  16 Jan 2022, 14:56:25

. 
. *input data
. use final2,clear

. 
. * local xx "fine finedfirm laborinsec_a laborinsec_b so2 popu_a popu_b secgrp_a secg
> rp_b gov_a gov_b land_a land_b"
. foreach v of local xx{
  2. drop if `v' ==.
  3. }

. 
. * local xx "delivery wage_a wage_b domestic_a domestic_b HMT_a HMT_b fdi_a fdi_b tel
> e mobile dfiirm_a dfirm_b Hfirm_a Hfirm_b ffirm_a ffirm_b"
. 
. foreach v of local xx{
  2. drop if `v'==.
  3. }

. 
. 
. *data summary
. summarize

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
          id |      2,262    143.6499    83.76602          1        291
        year |      2,262     2011.51    2.293701       2008       2015
     seaside |      2,262    .0583554    .2344662          0          1
        vice |      2,262    .0636605    .2442011          0          1
        fine |      2,262    .0003769    .0003719   5.41e-06   .0034999
-------------+---------------------------------------------------------
   finedfirm |      2,262    .0575679     .040476   .0070243   .2668394
laborinsec_a |      2,262     44.9394    14.19853       4.46       84.4
laborinsec_b |      2,262    46.84789    15.25624       3.65      85.73
         so2 |      2,262    58099.43    54107.21          2     627238
      popu_a |      2,262    436.7734    304.2198      18.59       5346
-------------+---------------------------------------------------------
      popu_b |      2,262    138.4073     164.192       15.1     1770.6
    secgrp_a |          0
    secgrp_b |      2,231    50.06108    12.13707       9.74      90.97
       gov_a |      2,262     2045.41    9338.269        .38     252777
       gov_b |      2,261    306.9964    1139.136        .25      19608
-------------+---------------------------------------------------------
      land_a |      2,260    18332.54    102954.6        868    4779788
      land_b |          0
    delivery |      2,251    11273.06    20776.72          2     554203
      wage_a |      2,243    38555.78     14239.8       4958   320626.3
      wage_b |      2,235    41213.27    17734.83       4792     576545
-------------+---------------------------------------------------------
  domestic_a |      2,261    2.04e+07    2.41e+07      40373   1.80e+08
  domestic_b |      2,262    1.07e+07    1.75e+07      20767   1.80e+08
       HMT_a |          0
       HMT_b |          0
       fdi_a |      2,129     4680192    1.42e+07        500   1.51e+08
-------------+---------------------------------------------------------
       fdi_b |          0
        tele |      2,260    91.85339     108.776          4     1015.4
      mobile |          0
     dfirm_a |          0
     dfirm_b |      2,252    497.6958    3466.282       1.57     159381
-------------+---------------------------------------------------------
     Hfirm_a |          0
     Hfirm_b |      2,032    130.4764    1371.405          1   56508.24
     ffirm_a |      2,162    162125.8     3809457          1   1.76e+08
     ffirm_b |      2,091    95417.16     2202046          1   9.99e+07

. *declare individual identifier and time indentifier
. xtset id year
repeated time values within panel
r(451);

end of do-file

r(451);

. exit, clear
